Repository: Crypto-Currency-Projects/pine_script_docs
Catalog: source/locales/*/LC_MESSAGES/introduction.po
Languages: ru

source: Introduction
ru: Введение

source: We created our own coding language called `Pine Script <https://blog.tradingview.com/en/tradingview-s-pine-script-introduction-203/>`__, which allows users to create customized studies and signals and run them on our servers. Please note that Pine was designed as a lightweight language, focused on the specific task of developing indicators. Since its creation, all pre-built indicators have been coded in Pine. It's our explicit goal to keep it accessible and easy to understand to the widest possible audience. Please note that Pine is cloud-based and therefore different in nature to client-side solutions. Please also note that it's not our goal to have a language with high-end coding capabilities for building very complex tools. In this sense Pine cannot be compared to a full-blown programming language, but we are happy to consider any request to add a feature. Improving it further and making it more powerful is one of the highest priorities for us.
ru: Мы создали собственный язык кодирования под названием `Pine Script <https://blog.tradingview.com/en/tradingview-s-pine-script-introduction-203/>`__, который позволяет пользователям создавать индивидуальные исследования и сигналы и запускать их на наших серверах. Обратите внимание, что Pine был разработан как легкий язык, ориентированный на конкретную задачу разработки индикаторов. С момента своего создания все готовые индикаторы были закодированы в Pine. Это наша явная цель - обеспечить ее доступность и простоту понимания самой широкой аудитории. Обратите внимание, что Pine выполняется в облаке и, следовательно, отличается по своей природе от решений на стороне клиента. Также обратите внимание, что наша цель не в том, чтобы иметь язык с превосходными возможностями кодирования для создания очень сложных инструментов. В этом смысле Pine не может сравниться с полномасштабным языком программирования, но мы с удовольствием рассмотрим любой запрос на добавление функции. Дальнейшее его улучшение и повышение его эффективности является одним из самых приоритетных для нас.

source: Because each study uses computational resources in the cloud, we have put limits on certain aspects of Pine (as few as possible but as many as needed) in order to share these resources fairly among our users. We need to ensure the platform keeps running smoothly and no-one is negatively affected by scripts that might otherwise consume a disproportionate amount of power. The imposed limits apply to elements such as the amount of data from additional symbols, loop calculations, memory usage and script size. Additionally, we keep Pine `syntax and semantics <https://www.tradingview.com/study-script-reference/>`__ simple so it can handle common tasks efficiently. We will continue to improve the documentation and support to ensure that anyone who wants to can `learn and use Pine <Pine_Script_Tutorial>`__, which will help the development community grow, get more robust and create more helpful analysis.
ru: Поскольку каждое исследование использует вычислительные ресурсы в облаке, мы поставили ограничения на некоторые аспекты Pine (как можно меньше, но столько, сколько необходимо), чтобы распределить эти ресурсы справедливо среди наших пользователей. Нам нужно обеспечить бесперебойную работу платформы, и на нее не оказывают негативного влияния скрипты, которые в противном случае могли бы потреблять непропорциональное количество энергии. Наложенные ограничения применяются к таким элементам, как объем данных из дополнительных символов, вычисления циклов, использование памяти и размер скрипта. Кроме того, мы сохраняем `синтаксис и семантику <https://www.tradingview.com/study-script-reference/>`__ Pine простым, чтобы эффективно справляться с общими задачами. Мы продолжим улучшать документацию и поддержку, чтобы каждый, кто хочет, изучал и использовал Pine, что поможет сообществу разработчиков расти, стать более надежным и создать более полезный анализ.

source: Choosing a license or not is entirely up to you. You are under no obligation to do so. If you publish scripts with open source code you can select a license of your choice. You can include the license in the comments section of a script (preferably in the beginning). Our position on the matter is very much like that of `GitHub <https://help.github.com/articles/licensing-a-repository/>`__.
ru: Решение о том, выбирать лиценцию или нет, целиком и полностью лежит на Вас. Вы не обязаны делать это. Если вы публикуете скипты с открытым исходным кодом, то вы можете выбрать любую лицензию. Включите текст лицензии в комментариях к коду скрипта (желательно в начале). Наша позиция на этот счёт аналогична `GitHub <https://help.github.com/articles/licensing-a-repository/>`__.

source: Versions
ru: Версии

source: Currently there are three versions of Pine Script Language. A special attribute must be used in the first line of a code to switch between versions ``//@version=N`` where ``N`` is number. Note, that Pine Script Language versions are incompatible with each other.
ru: В настоящее время (на момент редактирования русскоязычной версии англ. статьи) существует три версии языка Pine Script. В первой строке кода должен использоваться специальный атрибут для переключения между версиями ``//@version=N`` где ``N`` - номер версии. Обратите внимание, что версии языка Pine Script несовместимы друг с другом.

source: Features introduced in version 2:
ru: Особенности, представленные в версии 2:

source: `mutable variables <Expressions,_Declarations_and_Statements#Variable_Assignment>`__,
ru: `изменяемые переменные <Expressions,_Declarations_and_Statements#Variable_Assignment>`__,

source: `if statement <Expressions,_Declarations_and_Statements#.E2.80.98if.E2.80.99_statement>`__,
ru: `оператор if <Expressions,_Declarations_and_Statements#.E2.80.98if.E2.80.99_statement>`__,

source: `for statement <Expressions,_Declarations_and_Statements#.E2.80.98for.E2.80.99_statement>`__.
ru: `оператор for <Expressions,_Declarations_and_Statements#.E2.80.98for.E2.80.99_statement>`__.

source: Features introduced in version 3:
ru: Особенности, представленные в версии 3:

source: new security behavour, controlled by parameter: `lookahead <Context_Switching,_The_‘security’_Function#Barmerge:_gaps_and_lookahead>`__,
ru: Новое поведение функции ``security``, контролируемое параметром: `lookahead <Context_Switching,_The_‘security’_Function#Barmerge:_gaps_and_lookahead>`__,

source: self-referenced and forward-referenced variables removed,
ru: self-referenced и forward-referenced переменные удалены из языка,

source: changes in type system: forbid math operations on booleans,
ru: изменения в системе типов: запрет на математические операции с логическими значениями,

source: `input with options <https://blog.tradingview.com/en/several-new-features-added-pine-scripting-language-3933/>`__,
ru: строковый input с вариантами <https://blog.tradingview.com/en/several-new-features-added-pine-scripting-language-3933/>`__,

source: `keyword arguments supported in all built-in functions <https://blog.tradingview.com/en/kwargs-syntax-now-covers-built-functions-3914/>`__,
ru: `keyword аргументы поддерживаются всеми built-in функциями <https://blog.tradingview.com/en/kwargs-syntax-now-covers-built-functions-3914/>`__,

source: `compile time constants <https://blog.tradingview.com/en/possibilities-compile-time-constants-4127/>`__.
ru: `константы времени компиляции <https://blog.tradingview.com/en/possibilities-compile-time-constants-4127/>`__.

source: See `Version 3 Release Notes <Pine_Script:_Release_Notes#Pine_Version_3>`__ and `Migration Guide <Pine_Version_3_Migration_Guide>`__ for details.
ru: Подробнее смотри в `Version 3 Release Notes <Pine_Script:_Release_Notes#Pine_Version_3>`__ and `Migration Guide <Pine_Version_3_Migration_Guide>`__.
